src/main/resources/ASU_WFS_SOAP.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:ns="http://wfs.ws.gci.asu.edu"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:wfs="http://www.opengis.net/wfs/2.0"
	xmlns:ows="http://www.opengis.net/ows/1.1"
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
	name="ASU_WFS_SOAP"	targetNamespace="http://wfs.ws.gci.asu.edu">
	<wsdl:types>
		<xsd:schema targetNamespace="http://wfs.ws.gci.asu.edu"></xsd:schema>
		<xsd:schema targetNamespace="http://www.opengis.net/wfs/2.0">
			<xsd:include schemaLocation="http://schemas.opengis.net/wfs/2.0/wfs.xsd" />
		</xsd:schema>
		<xsd:schema targetNamespace="http://www.opengis.net/ows/1.1">
			<xsd:include schemaLocation="http://schemas.opengis.net/ows/1.1.0/owsAll.xsd" />
		</xsd:schema>		
	</wsdl:types>
	<wsdl:message name="GetCapabilitiesRequest">
		<wsdl:part element="wfs:GetCapabilities" name="BodyElement" />
	</wsdl:message>
	<wsdl:message name="GetCapabilitiesResponse">
		<wsdl:part element="wfs:WFS_Capabilities" name="BodyElement" />
	</wsdl:message>
	<wsdl:message name="ServiceExceptionReport">
		<wsdl:part element="ows:ExceptionReport" name="BodyElement" />
	</wsdl:message>
	<wsdl:portType name="ASU_WFS_SOAP_PortType">
		<wsdl:operation name="GetCapabilities">
			<wsdl:input message="ns:GetCapabilitiesRequest" />
			<wsdl:output message="ns:GetCapabilitiesResponse" />
			<wsdl:fault message="ns:ServiceExceptionReport" name="serviceException"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="ASU_WFS_SOAP12_Binding" type="ns:ASU_WFS_SOAP_PortType">
		<soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="GetCapabilities">
			<soap12:operation soapAction="GetCapabilities" style="document"/>
			<wsdl:input >
				<soap12:body use="literal" />
			</wsdl:input>
			<wsdl:output >
				<soap12:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="serviceException">
				<soap12:fault use="literal"/>
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="ASU_WFS_SOAP_Service">
		<wsdl:port name="ASU_WFS_SOAP12_Service" binding="ns:ASU_WFS_SOAP12_Binding" >
			<soap12:address location="http://polar.geodacenter.org/wfs/soap12" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
